Revit 2022 API
WorksetTable Methods
The WorksetTable type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetActiveWorksetId
 Returns the active workset's WorksetId.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWorkset(Guid)
 Returns the workset from a input Guid.
GetWorkset(WorksetId)
 Returns the workset from a input WorksetId.
IsWorksetNameUnique
 Checks if the given workset name is unique in the document.
RenameWorkset
 Renames the workset.
SetActiveWorksetId
 Sets the active workset.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace